coocox/Mplib/Toshaba/TMPM36x/TMPM365/cmsis_lib/lib/source/tmpm365_dmac.c
    assert_param(IS_FUNCTIONAL_STATE(InitStruct->TxINT));

    if (Chx == DMAC_CHANNEL_0) {
        /* Set DMA source address */
        DMACx->C0SRCADDR = InitStruct->SrcAddr;
        /* Set DMA destination address */
        DMACx->C0DESTADDR = InitStruct->DstAddr;

        /* Initialize DMA CxCONTROL register */
        tmp = DMACx->C0CONTROL;
        tmp &= CXCONTROL_INIT_MASK;
        tmp |= InitStruct->TxSize | (uint32_t) InitStruct->SrcIncrementState << 26U |
            (uint32_t) InitStruct->DstIncrementState << 27U |
            (uint32_t) InitStruct->SrcBitWidth << 18U |
            (uint32_t) InitStruct->DstBitWidth << 21U |
            (uint32_t) InitStruct->SrcBurstSize << 12U |
            (uint32_t) InitStruct->DstBurstSize << 15U | (uint32_t) InitStruct->TxINT << 31U;
        DMACx->C0CONTROL = tmp;

        /* Initialize DMA CxCONFIGURATION register */
        tmp = DMACx->C0CONFIGURATION;
        tmp &= CXCONFIGURATION_INIT_MASK;
        tmp |= InitStruct->TxDirection;

        switch (InitStruct->TxDirection) {
        case DMAC_MEMORY_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
            }
            break;
        case DMAC_PERIPH_TO_MEMORY:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            }
            break;
        case DMAC_PERIPH_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            }
            break;
        default:
            /* Do nothing */
            break;
        }

        DMACx->C0CONFIGURATION = tmp;
    } else {
        /* Set DMA source address */
        DMACx->C1SRCADDR = InitStruct->SrcAddr;
        /* Set DMA destination address */
        DMACx->C1DESTADDR = InitStruct->DstAddr;

        /* Initialize DMA CxCONTROL register */
        tmp = DMACx->C1CONTROL;
        tmp &= CXCONTROL_INIT_MASK;
        tmp |= InitStruct->TxSize | (uint32_t) InitStruct->SrcIncrementState << 26U |
            (uint32_t) InitStruct->DstIncrementState << 27U |
            (uint32_t) InitStruct->SrcBitWidth << 18U |
            (uint32_t) InitStruct->DstBitWidth << 21U |
            (uint32_t) InitStruct->SrcBurstSize << 12U |
            (uint32_t) InitStruct->DstBurstSize << 15U | (uint32_t) InitStruct->TxINT << 31U;
        DMACx->C1CONTROL = tmp;

        /* Initialize DMA CxCONFIGURATION register */
        tmp = DMACx->C1CONFIGURATION;
        tmp &= CXCONFIGURATION_INIT_MASK;
        tmp |= InitStruct->TxDirection;

        switch (InitStruct->TxDirection) {
        case DMAC_MEMORY_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
            }
            break;
        case DMAC_PERIPH_TO_MEMORY:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            }
            break;
        case DMAC_PERIPH_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            }
            break;
        default:
            /* Do nothing */
            break;
        }

        DMACx->C1CONFIGURATION = tmp;
    }
}

/** @} */
/* End of group DMAC_Exported_Functions */

/** @} */
/* End of group DMAC */

/** @} */
/* End of group TX03_Periph_Driver */
#endif                          /* defined(__TMPM365_DMAC_H) */
